SteveLRojas/mcu_libs/CH32V203/ch32v203_usbfsd_cdc/user_libs/ch32v203_usbfsd_cdc.c
/*
 * ch32v203_usbfsd_cdc.c
 *
 *  Created on: Aug 27, 2024
 *      Author: Steve
 */
#include "ch32v20x.h"
#include "ch32v203_usbfsd.h"
#include "ch32v203_usbfsd_cdc.h"
//TODO: what happens if EP_2 receives a zero length packet?

#define SET_LINE_CODING         0x20  // host configures line coding
#define GET_LINE_CODING         0x21  // host reads configured line coding
#define SET_CONTROL_LINE_STATE  0x22  // generates RS-232/V.24 style control signals
#define SEND_BREAK              0x23  // send break

#define CDC_DEV_DESCR_SIZE 18
#define CDC_CONF_DESCR_SIZE 67
#define CDC_LINE_CODING_SIZE 7
#define CDC_SERIAL_STATE_SIZE 10

/* USB standard device request code */
#ifndef USB_GET_DESCRIPTOR
#define USB_GET_STATUS          0x00
#define USB_CLEAR_FEATURE       0x01
#define USB_SET_FEATURE         0x03
#define USB_SET_ADDRESS         0x05
#define USB_GET_DESCRIPTOR      0x06
#define USB_SET_DESCRIPTOR      0x07
#define USB_GET_CONFIGURATION   0x08
#define USB_SET_CONFIGURATION   0x09
#define USB_GET_INTERFACE       0x0A
#define USB_SET_INTERFACE       0x0B
#define USB_SYNCH_FRAME         0x0C
#endif

/* USB HID class request code */
#ifndef HID_GET_REPORT
#define HID_GET_REPORT          0x01
#define HID_GET_IDLE            0x02
#define HID_GET_PROTOCOL        0x03
#define HID_SET_REPORT          0x09
#define HID_SET_IDLE            0x0A
#define HID_SET_PROTOCOL        0x0B
#endif

/* Bit define for USB request type */
#ifndef USB_REQ_TYP_MASK
#define USB_REQ_TYP_IN          0x80            /* control IN, device to host */
#define USB_REQ_TYP_OUT         0x00            /* control OUT, host to device */
#define USB_REQ_TYP_READ        0x80            /* control read, device to host */
#define USB_REQ_TYP_WRITE       0x00            /* control write, host to device */
#define USB_REQ_TYP_MASK        0x60            /* bit mask of request type */
#define USB_REQ_TYP_STANDARD    0x00
#define USB_REQ_TYP_CLASS       0x20
#define USB_REQ_TYP_VENDOR      0x40
#define USB_REQ_TYP_RESERVED    0x60
#define USB_REQ_RECIP_MASK      0x1F            /* bit mask of request recipient */
#define USB_REQ_RECIP_DEVICE    0x00
#define USB_REQ_RECIP_INTERF    0x01
#define USB_REQ_RECIP_ENDP      0x02
#define USB_REQ_RECIP_OTHER     0x03
#endif

/* USB descriptor type */
#ifndef USB_DESCR_TYP_DEVICE
#define USB_DESCR_TYP_DEVICE    0x01
#define USB_DESCR_TYP_CONFIG    0x02
#define USB_DESCR_TYP_STRING    0x03
#define USB_DESCR_TYP_INTERF    0x04
#define USB_DESCR_TYP_ENDP      0x05
#define USB_DESCR_TYP_QUALIF    0x06
#define USB_DESCR_TYP_SPEED     0x07
#define USB_DESCR_TYP_OTG       0x09
#define USB_DESCR_TYP_HID       0x21
#define USB_DESCR_TYP_REPORT    0x22
#define USB_DESCR_TYP_PHYSIC    0x23
#define USB_DESCR_TYP_CS_INTF   0x24
#define USB_DESCR_TYP_CS_ENDP   0x25
#define USB_DESCR_TYP_HUB       0x29
#endif

typedef struct _USB_SETUP_REQ
{
    uint8_t bRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} usb_setup_req_t;

typedef struct _USBFSD_DBL_BUF
{
	uint8_t t0_buf[64];
	uint8_t t1_buf[64];
} usbfsd_dbl_buf_t;

uint16_t cdc_last_data_time;
uint16_t cdc_last_status_time;
volatile uint8_t cdc_tx_enabled;
volatile uint8_t cdc_rx_enabled;

volatile uint8_t ep0_buffer[CDC_ENDP0_BUF_SIZE] __attribute__ ((aligned(4)));
volatile uint8_t ep1_buffer[CDC_ENDP1_SIZE] __attribute__ ((aligned(4)));
volatile usbfsd_dbl_buf_t ep2_buffer __attribute__ ((aligned(4)));
volatile usbfsd_dbl_buf_t ep3_buffer __attribute__ ((aligned(4)));

uint8_t ep2_read_select;
volatile uint8_t ep2_t0_num_bytes;
uint8_t ep2_t0_read_offset;
volatile uint8_t ep2_t1_num_bytes;
uint8_t ep2_t1_read_offset;

volatile uint8_t ep3_wip;
volatile uint8_t ep3_write_select;
volatile uint8_t ep3_t0_num_bytes;
volatile uint8_t ep3_t1_num_bytes;

#define cdc_setup_buf ((usb_setup_req_t*)ep0_buffer)
#define CDC_ENDP2_SIZE 64
#define CDC_ENDP3_SIZE 64

uint8_t cdc_setup_req;
uint8_t cdc_setup_type;
uint16_t cdc_setup_len;

const uint8_t* descriptor_ptr;
uint8_t cdc_address;
uint8_t cdc_config;

volatile cdc_line_coding_t cdc_line_coding = {125000, 0x00, 0x00, 0x08};	//125K baud, 1 stop, no parity, 8 data
volatile uint8_t cdc_control_line_state = 0;

/* USB Device Descriptors */
static const uint8_t cdc_device_descriptor[] __attribute__ ((aligned(2))) =
{
    CDC_DEV_DESCR_SIZE,				// bLength
    0x01,                           // bDescriptorType
    0x10, 0x01,                     // bcdUSB
    0x02,                           // bDeviceClass
    0x00,                           // bDeviceSubClass
    0x00,                           // bDeviceProtocol
    CDC_ENDP0_SIZE,					// bMaxPacketSize0
    0x86, 0x1A,                     // idVendor
    0x0C, 0xFE,                     // idProduct
    0x00, 0x01,                     // bcdDevice
    0x01,                           // iManufacturer
    0x02,                           // iProduct
    0x03,                           // iSerialNumber
    0x01,                           // bNumConfigurations
};

/* USB Configuration Descriptors */
static const uint8_t cdc_config_descriptor[] __attribute__ ((aligned(2))) =
{
    /* Configuration Descriptor */
    0x09,                           // bLength
    0x02,                           // bDescriptorType
    CDC_CONF_DESCR_SIZE & 0xFF, CDC_CONF_DESCR_SIZE >> 8, // wTotalLength
    0x02,                           // bNumInterfaces
    0x01,                           // bConfigurationValue
    0x00,                           // iConfiguration
    0x80,                           // bmAttributes: Bus Powered
    0x32,                           // MaxPower: 100mA

    /* Interface 0 (CDC) descriptor */
    0x09,                           // bLength
    0x04,                           // bDescriptorType (Interface)
    0x00,                           // bInterfaceNumber 0
    0x00,                           // bAlternateSetting
    0x01,                           // bNumEndpoints 1
    0x02,                           // bInterfaceClass	(Communications Interface Class)
    0x02,                           // bInterfaceSubClass	 (Abstract Control Model)
    0x01,                           // bInterfaceProtocol	(AT Commands: V.250)
    0x04,                           // iInterface (String Index)

    /* Functional Descriptors */
    0x05, 0x24, 0x00, 0x10, 0x01,	//CDC Header Functional Descriptor (CDC 1.2)

    /* Length/management descriptor */
    0x05, 0x24, 0x01, 0x00, 0x01,	//Call Management Functional Descriptor (interface 1)
    0x04, 0x24, 0x02, 0x02,			//Abstract Control Management Functional Descriptor
    0x05, 0x24, 0x06, 0x00, 0x01,	//Union Functional Descriptor (interface 0, interface 1)

    /* Interrupt upload endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x81,                           // bEndpointAddress (IN/D2H)
    0x03,                           // bmAttributes (Interrupt)
    CDC_ENDP1_SIZE & 0xFF, CDC_ENDP1_SIZE >> 8, // wMaxPacketSize
    0x01,                           // bInterval 1 (unit depends on device speed)

    /* Interface 1 (data interface) descriptor */
    0x09,                           // bLength
    0x04,                           // bDescriptorType (Interface)
    0x01,                           // bInterfaceNumber 1
    0x00,                           // bAlternateSetting
    0x02,                           // bNumEndpoints 2
    0x0A,                           // bInterfaceClass	(Data Interface Class)
    0x00,                           // bInterfaceSubClass
    0x00,                           // bInterfaceProtocol
    0x00,                           // iInterface (String Index)

    /* Endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x02,                           // bEndpointAddress (OUT/H2D)
    0x02,                           // bmAttributes (Bulk)
    CDC_ENDP2_SIZE & 0xFF, CDC_ENDP2_SIZE >> 8, // wMaxPacketSize
    0x00,                           // bInterval 0 (unit depends on device speed)

    /* Endpoint descriptor */
    0x07,                           // bLength
    0x05,                           // bDescriptorType (Endpoint)
    0x83,                           // bEndpointAddress (IN/D2H)
    0x02,                           // bmAttributes (Bulk)
    CDC_ENDP3_SIZE & 0xFF, CDC_ENDP3_SIZE >> 8, // wMaxPacketSize
    0x00                            // bInterval 0 (unit depends on device speed)
};

/* USB String Descriptors */
static const uint8_t cdc_string_lang_id[] __attribute__ ((aligned(2))) =
{
	0x04,
	0x03,
	0x09,
	0x04
};

/* USB Device String Vendor */
static const uint8_t cdc_string_vendor[] __attribute__ ((aligned(2))) =
{
	14,
	0x03,
	'w',0,'c',0,'h',0,'.',0,'c',0,'n',0
};

