SteveLRojas/mcu_libs/CH32V203/ch32v203_usbfsd_cdc/user_libs/ch32v203_usbfsd_cdc.c
/* USB Device String Product */
static const uint8_t cdc_string_product[] __attribute__ ((aligned(2))) =
{
    22,
    0x03,
    'U', 0, 'S', 0, 'B', 0, ' ', 0, 'S', 0, 'e', 0, 'r', 0, 'i', 0, 'a', 0, 'l', 0
};

/* USB Device String Serial */
static const uint8_t cdc_string_serial[] __attribute__ ((aligned(2))) =
{
	22,
	0x03,
	'D', 0, 'E', 0, 'A', 0, 'D', 0, 'B', 0, 'E', 0 , 'E', 0, 'F', 0, '0', 0, '1', 0
};

static const uint8_t cdc_serial_state[] __attribute__ ((aligned(2))) = {0xA1, 0x20, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00};

void cdc_copy_descriptor(uint8_t len)
{
	volatile uint8_t* dest = ep0_buffer;
	while(len)
	{
		*dest = *descriptor_ptr;
		++dest;
		++descriptor_ptr;
		--len;
	}
}

// HINT: This library contains some nasty hacks to work around bugs in CH32V203.
// Enabling SOF interrupts makes interrupt transfers fail, since the SOF triggers UIF_TRANSFER (all enpoints respond with NAK while UIF_TRANSFER is set).
// When a notification needs to be sent the SOF interrupts are disabled so that the interrupt transfer can happen.
// SOF interrupts are re-enabled after the interrupt transfer completes.
void cdc_on_sof(void)
{
	// check for timeout, if the buffer is not being written to then enable transmitting and mark the buffer as full
	if(((uint16_t)(usbfsd_sof_count - cdc_last_data_time) >= (uint16_t)CDC_TIMEOUT_MS) && !(ep3_wip | cdc_tx_enabled))
	{
		if(ep3_write_select)
		{
			usbfsd_set_ep3_tx_len(ep3_t1_num_bytes);
			ep3_t1_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 0;
		}
		else
		{
			usbfsd_set_ep3_tx_len(ep3_t0_num_bytes);
			ep3_t0_num_bytes = CDC_ENDP3_SIZE;
			ep3_write_select = 1;
		}
		usbfsd_set_ep3_in_res(USBFSD_RES_ACK);
		cdc_tx_enabled = 1;
	}

	if((uint16_t)(usbfsd_sof_count - cdc_last_status_time) >= (uint16_t)CDC_TIMEOUT_MS)
	{
		usbfsd_set_ep1_tx_len(CDC_SERIAL_STATE_SIZE);
		usbfsd_set_ep1_in_res(USBFSD_RES_ACK);
		usbfsd_disable_interrupts(USBFSD_INT_SOF);
	}
}

void cdc_on_out(uint8_t ep)
{
	uint8_t idx;

	if(ep == EP_0)
	{
		if((cdc_setup_req == SET_LINE_CODING) && ((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS))
		{
			for(idx = 0; idx < CDC_LINE_CODING_SIZE; idx++)
			{
				((uint8_t*)&cdc_line_coding)[idx] = ep0_buffer[idx];
			}
		}
		usbfsd_set_ep0_tx_len(0);
		usbfsd_set_ep0_out_tog_res(USBFSD_TOG_1 | USBFSD_RES_ACK);
		usbfsd_set_ep0_in_tog_res(USBFSD_TOG_1 | USBFSD_RES_ACK);
	}

	if(ep == EP_2)
	{
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will receive
		if(usbfsd_get_ep2_out_toggle())
		{
			ep2_t0_num_bytes = usbfsd_get_rx_len();
			if(ep2_t1_num_bytes)
			{
				usbfsd_set_ep2_out_res(USBFSD_RES_NAK);
				cdc_rx_enabled = 0;
			}
		}
		else
		{
			ep2_t1_num_bytes = usbfsd_get_rx_len();
			if(ep2_t0_num_bytes)
			{
				usbfsd_set_ep2_out_res(USBFSD_RES_NAK);
				cdc_rx_enabled = 0;
			}
		}
	}
}

void cdc_on_in(uint8_t ep)
{
	uint8_t len;

	if(ep == EP_0)
	{
		if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_req)
			{
			case USB_GET_DESCRIPTOR:
				len = cdc_setup_len >= CDC_ENDP0_SIZE ? CDC_ENDP0_SIZE : cdc_setup_len;
				cdc_copy_descriptor(len);
				cdc_setup_len -= len;
				usbfsd_set_ep0_tx_len(len);
				usbfsd_toggle_ep0_in_toggle();
				break;
			case USB_SET_ADDRESS:
				usbfsd_set_addr(cdc_address);
				usbfsd_set_ep0_in_res(USBFSD_RES_NAK);
				break;
			default:
				usbfsd_set_ep0_tx_len(0);
				usbfsd_set_ep0_in_res(USBFSD_RES_NAK);
				break;
			}
		}
		else
		{
			usbfsd_set_ep0_tx_len(0);
			usbfsd_set_ep0_in_res(USBFSD_RES_NAK);
		}
	}

	if(ep == EP_1)
	{
		usbfsd_set_ep1_tx_len(0);
		usbfsd_set_ep1_in_res(USBFSD_RES_NAK);
		cdc_last_status_time = usbfsd_sof_count;
		usbfsd_enable_interrupts(USBFSD_INT_SOF);
		++usbfsd_sof_count;
	}

	if(ep == EP_3)
	{
		cdc_last_data_time = usbfsd_sof_count;
		usbfsd_set_ep3_tx_len(CDC_ENDP3_SIZE);
		//auto-toggle is enabled, so here the toggle should point to the next buffer that will transmit
		if(usbfsd_get_ep3_in_toggle())
		{
			ep3_t0_num_bytes = 0;
			if(ep3_t1_num_bytes != CDC_ENDP3_SIZE)
			{
				usbfsd_set_ep3_tx_len(0);
				usbfsd_set_ep3_in_res(USBFSD_RES_NAK);
				cdc_tx_enabled = 0;
			}
		}
		else
		{
			ep3_t1_num_bytes = 0;
			if(ep3_t0_num_bytes != CDC_ENDP3_SIZE)
			{
				usbfsd_set_ep3_tx_len(0);
				usbfsd_set_ep3_in_res(USBFSD_RES_NAK);
				cdc_tx_enabled = 0;
			}
		}
	}
}

void cdc_on_setup(uint8_t ep)
{
	uint8_t len;
	uint8_t idx;

	if(ep == EP_0)
	{
		cdc_setup_len = cdc_setup_buf->wLength;
		cdc_setup_req = cdc_setup_buf->bRequest;
		cdc_setup_type = cdc_setup_buf->bRequestType;
		descriptor_ptr = 0;
		len = 0;

		if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD)
		{
			switch(cdc_setup_req)
			{
			case USB_GET_STATUS:
				ep0_buffer[0] = 0x00;
				ep0_buffer[1] = 0x00;
				len = 2;
				break;
			case USB_CLEAR_FEATURE:
				if((cdc_setup_type & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
				{
					switch((uint8_t)(cdc_setup_buf->wIndex))
					{
					case 0x81:
						usbfsd_set_ep1_in_toggle(USBFSD_TOG_0);
						usbfsd_set_ep1_in_res(USBFSD_RES_NAK);
						usbfsd_enable_interrupts(USBFSD_INT_SOF);	//SOF interrupts must be enabled when EP1 is not ready
						break;
					case 0x02:
						usbfsd_set_ep2_out_toggle(USBFSD_TOG_0);
						usbfsd_set_ep2_out_res(USBFSD_RES_ACK);
						break;
					case 0x83:
						usbfsd_set_ep3_in_toggle(USBFSD_TOG_0);
						usbfsd_set_ep3_in_res(USBFSD_RES_NAK);
						break;
					default:
						len = 0xFF;
						break;
					}
				}
				else
				{
					len = 0xFF;
				}
				break;
			case USB_SET_FEATURE:
				if(((cdc_setup_type & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) && !(cdc_setup_buf->wIndex & 0xFF00))
				{
					switch((uint8_t)(cdc_setup_buf->wIndex))
					{
					case 0x81:
						usbfsd_set_ep1_in_toggle(USBFSD_TOG_0);
						usbfsd_set_ep1_in_res(USBFSD_RES_STALL);
						usbfsd_enable_interrupts(USBFSD_INT_SOF);	//SOF interrupts must be enabled when EP1 is not ready
						break;
					case 0x02:
						usbfsd_set_ep2_out_toggle(USBFSD_TOG_0);
						usbfsd_set_ep2_out_res(USBFSD_RES_STALL);
						break;
					case 0x83:
						usbfsd_set_ep3_in_toggle(USBFSD_TOG_0);
						usbfsd_set_ep3_in_res(USBFSD_RES_STALL);
						break;
					default:
						len = 0xFF;
						break;
					}
				}
				else
				{
					len = 0xFF;
				}
				break;
			case USB_SET_ADDRESS:
				cdc_address = (uint8_t)(cdc_setup_buf->wValue);
				break;
			case USB_GET_DESCRIPTOR:
				switch((uint8_t)(cdc_setup_buf->wValue >> 8))
				{
				case USB_DESCR_TYP_DEVICE:
					descriptor_ptr = cdc_device_descriptor;
					len = CDC_DEV_DESCR_SIZE;
					break;
				case USB_DESCR_TYP_CONFIG:
					descriptor_ptr = cdc_config_descriptor;
					len = CDC_CONF_DESCR_SIZE;
					break;
				case USB_DESCR_TYP_STRING:
					switch((uint8_t)(cdc_setup_buf->wValue))
					{
					case 0:
						descriptor_ptr = cdc_string_lang_id;
						break;
					case 1:
						descriptor_ptr = cdc_string_vendor;
						break;
					case 3:
						descriptor_ptr = cdc_string_serial;
						break;
					default:
						descriptor_ptr = cdc_string_product;
						break;
					}
					len = descriptor_ptr[0];
					break;
				default:
					len = 0xFF;
					break;
				}
				break;
			case USB_GET_CONFIGURATION:
				ep0_buffer[0] = cdc_config;
				len = 1;
				break;
			case USB_SET_CONFIGURATION:
				cdc_config = (uint8_t)(cdc_setup_buf->wValue);
				usbfsd_enable_interrupts(USBFSD_INT_SOF);
				break;
			case USB_GET_INTERFACE:
				ep0_buffer[0] = 0;
				len = 1;
				break;
			case USB_SET_INTERFACE:
				//nothing to do here
				break;
			default:
				len = 0xFF;
				break;
			}
		}
		else if((cdc_setup_type & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS)
		{
			switch(cdc_setup_req)
			{
			case GET_LINE_CODING:
				for(idx = 0; idx < CDC_LINE_CODING_SIZE; ++idx)
				{
					ep0_buffer[idx] = ((uint8_t*)&cdc_line_coding)[idx];
				}
				len = CDC_LINE_CODING_SIZE;
				break;
			case SET_CONTROL_LINE_STATE:
				cdc_control_line_state = ep0_buffer[2];
				break;
			case SET_LINE_CODING:
				// nothing to do here
				break;
			default:
				len = 0xFF;
				break;
			}
		}
		else
		{
			len = 0xFF;
		}

		if(len == 0xFF)
		{
			cdc_setup_req = 0xFF;
			usbfsd_set_ep0_out_tog_res(USBFSD_TOG_1 | USBFSD_RES_STALL);
			usbfsd_set_ep0_in_tog_res(USBFSD_TOG_1 | USBFSD_RES_STALL);
		}
		else
		{
			if(cdc_setup_len > len)
				cdc_setup_len = len;
			len = (cdc_setup_len > CDC_ENDP0_SIZE) ? CDC_ENDP0_SIZE : cdc_setup_len;

			if(descriptor_ptr)
				cdc_copy_descriptor(len);

			cdc_setup_len -= len;
			usbfsd_set_ep0_tx_len(len);
			usbfsd_set_ep0_out_tog_res(USBFSD_TOG_1 | USBFSD_RES_ACK);
			usbfsd_set_ep0_in_tog_res(USBFSD_TOG_1 | USBFSD_RES_ACK);
		}
	}	//end if(ep == EP_0)
}

void cdc_on_rst(void)
{
	usbfsd_disable_interrupts(USBFSD_INT_SOF);

	ep2_read_select = 0;
	ep2_t0_num_bytes = 0;
	ep2_t0_read_offset = 0;
	ep2_t1_num_bytes = 0;
	ep2_t1_read_offset = 0;

	ep3_wip = 0;
	ep3_write_select = 0;
	ep3_t0_num_bytes = 0;
	ep3_t1_num_bytes = 0;

	usbfsd_set_ep0_out_tog_res(USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0);
	usbfsd_set_ep0_in_tog_res(USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0);
	usbfsd_set_ep1_out_tog_res(USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1);
	usbfsd_set_ep1_in_tog_res(USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1);
	usbfsd_set_ep2_out_tog_res(USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1);
	usbfsd_set_ep2_in_tog_res(USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1);
	usbfsd_set_ep3_out_tog_res(USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1);
	usbfsd_set_ep3_in_tog_res(USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1);

