SteveLRojas/mcu_libs/CH32V203/ch32v203_usbfsd_cdc/user_libs/ch32v203_usbfsd_cdc.c
	cdc_last_data_time = 0;
	cdc_last_status_time = 0;
	usbfsd_sof_count = 0;
	cdc_tx_enabled = 0;
	cdc_rx_enabled = 1;
}

void cdc_enable_tx(void)
{
	// check toggle, if the buffer pointed to by the toggle is completely full then enable transmitting
	if(!cdc_tx_enabled && ((usbfsd_get_ep3_in_toggle() ? ep3_t1_num_bytes : ep3_t0_num_bytes) == CDC_ENDP3_SIZE))
	{
		usbfsd_set_ep3_tx_len(CDC_ENDP3_SIZE);
		usbfsd_set_ep3_in_res(USBFSD_RES_ACK);
		cdc_tx_enabled = 1;
	}
}

void cdc_enable_rx(void)
{
	// check toggle, if the buffer pointed to by the toggle is empty then enable receiving
	if(!cdc_rx_enabled && ((usbfsd_get_ep2_out_toggle() ? ep2_t1_num_bytes : ep2_t0_num_bytes) == 0))
	{
		usbfsd_set_ep2_out_res(USBFSD_RES_ACK);
		cdc_rx_enabled = 1;
	}
}

static const usbfsd_config_t usbfsd_config =
{
	(uint32_t)ep0_buffer,
	(uint32_t)ep1_buffer,
	(uint32_t)(&ep2_buffer),
	(uint32_t)(&ep3_buffer),
	0,
	0,
	0,
	0,
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0,	//EP_0 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0,	//EP_0 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1,	//EP_1 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1,	//EP_1 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1,	//EP_2 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1,	//EP_2 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_1,	//EP_3 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_1,	//EP_3 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0,	//EP_4 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0,	//EP_4 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0,	//EP_5 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0,	//EP_5 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0,	//EP_6 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0,	//EP_6 OUT
	USBFSD_TOG_0 | USBFSD_RES_NAK | USBFSD_AUTOTOG_0,	//EP_7 IN
	USBFSD_TOG_0 | USBFSD_RES_ACK | USBFSD_AUTOTOG_0,	//EP_7 OUT
	USBFSD_EP1_TX_EN | USBFSD_EP1_BUF_SINGLE | USBFSD_EP4_BUF_SINGLE,
	USBFSD_EP2_RX_EN | USBFSD_EP2_BUF_DOUBLE | USBFSD_EP3_TX_EN | USBFSD_EP3_BUF_DOUBLE,
	USBFSD_EP5_BUF_SINGLE | USBFSD_EP6_BUF_SINGLE,
	USBFSD_EP7_BUF_SINGLE,
	USBFSD_INT_TRANSFER | USBFSD_INT_RESET
};

void cdc_init(void)
{
	usbfsd_sof_callback = cdc_on_sof;
	usbfsd_out_callback = cdc_on_out;
	usbfsd_in_callback = cdc_on_in;
	usbfsd_setup_callback = cdc_on_setup;
	usbfsd_reset_callback = cdc_on_rst;
	usbfsd_wakeup_callback = 0;
	usbfsd_suspend_callback = 0;

	usbfsd_init(&usbfsd_config);
	cdc_set_serial_state(0x00);
}

void cdc_set_serial_state(uint8_t val)
{
	uint8_t idx;
	for(idx = 0; idx < CDC_SERIAL_STATE_SIZE; ++idx)
	{
		ep1_buffer[idx] = cdc_serial_state[idx];
	}
	ep1_buffer[8] = val;
	usbfsd_set_ep1_tx_len(CDC_SERIAL_STATE_SIZE);
	usbfsd_set_ep1_in_res(USBFSD_RES_ACK);
}

// Receive
uint16_t cdc_bytes_available(void)
{
	// count the number of bytes available in both buffers
	return (ep2_t0_num_bytes - ep2_t0_read_offset) + (ep2_t1_num_bytes - ep2_t1_read_offset);
}

uint8_t cdc_peek(void)
{
	if(ep2_read_select)
		return ep2_buffer.t1_buf[ep2_t1_read_offset];
	else
		return ep2_buffer.t0_buf[ep2_t0_read_offset];
}

uint8_t cdc_read_byte(void)
{
	uint8_t read_val;

	while(!cdc_bytes_available());

	if(ep2_read_select)
	{
		read_val = ep2_buffer.t1_buf[ep2_t1_read_offset];
		++ep2_t1_read_offset;
		if(ep2_t1_read_offset == ep2_t1_num_bytes)
		{
			ep2_t1_read_offset = 0;
			ep2_t1_num_bytes = 0;
			ep2_read_select = 0;
			cdc_enable_rx();
		}
	}
	else
	{
		read_val = ep2_buffer.t0_buf[ep2_t0_read_offset];
		++ep2_t0_read_offset;
		if(ep2_t0_read_offset == ep2_t0_num_bytes)
		{
			ep2_t0_read_offset = 0;
			ep2_t0_num_bytes = 0;
			ep2_read_select = 1;
			cdc_enable_rx();
		}
	}

	return read_val;
}

void cdc_read_bytes(uint8_t* dest, uint16_t num_bytes)
{
	uint16_t num_to_read = 0;

	while(num_bytes)
	{
		if(ep2_read_select)
		{
			num_to_read = ep2_t1_num_bytes - ep2_t1_read_offset;
			if(!num_to_read)
				continue;
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}

			num_bytes -= num_to_read;
			do
			{
				*dest = ep2_buffer.t1_buf[ep2_t1_read_offset];
				++dest;
				++ep2_t1_read_offset;
			} while(--num_to_read);

			if(ep2_t1_read_offset == ep2_t1_num_bytes)
			{
				ep2_t1_read_offset = 0;
				ep2_t1_num_bytes = 0;
				ep2_read_select = 0;
				cdc_enable_rx();
			}
		}
		else
		{
			num_to_read = ep2_t0_num_bytes - ep2_t0_read_offset;
			if(!num_to_read)
				continue;
			if(num_to_read > num_bytes)
			{
				num_to_read = num_bytes;
			}

			num_bytes -= num_to_read;
			do
			{
				*dest = ep2_buffer.t0_buf[ep2_t0_read_offset];
				++dest;
				++ep2_t0_read_offset;
			} while(--num_to_read);

			if(ep2_t0_read_offset == ep2_t0_num_bytes)
			{
				ep2_t0_read_offset = 0;
				ep2_t0_num_bytes = 0;
				ep2_read_select = 1;
				cdc_enable_rx();
			}
		}
	}
}

// Send
uint16_t cdc_bytes_available_for_write(void)
{
	return (CDC_ENDP3_SIZE - ep3_t0_num_bytes) + (CDC_ENDP3_SIZE - ep3_t1_num_bytes);
}

void cdc_write_byte(uint8_t val)
{
	uint8_t ep_num_bytes;

	ep3_wip = 1;
	if(ep3_write_select)
	{
		ep_num_bytes = ep3_t1_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}
		ep3_buffer.t1_buf[ep_num_bytes] = val;
		++ep_num_bytes;
		ep3_t1_num_bytes = ep_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_write_select = 0;
			cdc_enable_tx();
		}
	}
	else
	{
		ep_num_bytes = ep3_t0_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_wip = 0;
			return;
		}
		ep3_buffer.t0_buf[ep_num_bytes] = val;
		++ep_num_bytes;
		ep3_t0_num_bytes = ep_num_bytes;
		if(ep_num_bytes == CDC_ENDP3_SIZE)
		{
			ep3_write_select = 1;
			cdc_enable_tx();
		}
	}
	ep3_wip = 0;
}

void cdc_write_bytes(const uint8_t* src, uint16_t num_bytes)
{
	uint16_t num_to_write = 0;
	uint8_t ep_num_bytes;

	ep3_wip = 1;
	while(num_bytes)
	{
		if(ep3_write_select)
		{
			ep_num_bytes = ep3_t1_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;

			num_bytes -= num_to_write;
			do
			{
				ep3_buffer.t1_buf[ep_num_bytes] = *src;
				++src;
				++ep_num_bytes;
			} while(--num_to_write);
			ep3_t1_num_bytes = ep_num_bytes;

			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				ep3_write_select = 0;
				cdc_enable_tx();
			}
		}
		else
		{
			ep_num_bytes = ep3_t0_num_bytes;
			num_to_write = CDC_ENDP3_SIZE - ep_num_bytes;
			if(!num_to_write)
				continue;
			if(num_to_write > num_bytes)
				num_to_write = num_bytes;

			num_bytes -= num_to_write;
			do
			{
				ep3_buffer.t0_buf[ep_num_bytes] = *src;
				++src;
				++ep_num_bytes;
			} while(--num_to_write);
			ep3_t0_num_bytes = ep_num_bytes;

			if(ep_num_bytes == CDC_ENDP3_SIZE)
			{
				ep3_write_select = 1;
				cdc_enable_tx();
			}
		}
	}
	ep3_wip = 0;
}
